import json
from fractions import Fraction


def menu():
    print(' *************************************** \n * 1.Создать новую книгу               * \n * 2.Добавить сотрудника               * \n * 3.Добавить новые должности          * \n * 4.Добавить новый отдел              * \n * 5.Редактировать                     * \n * 6.Удалить                           * \n * 7.Поиск по книге                    * \n * 8.Ппоказать книгу.                  *\n * 9.Выход                             * \n *************************************** ')
    return int(input('Введите номер операции: '))

def view_result(data):
    print(data)
#=======================================================================

# Добавление человека в книгу
def get_new_name():
    print('\n============================================================================== \n')
    return str(input('Введите Ф.И.О. сотрудника: '))
def get_new_telephone():
    print('\n============================================================================== \n')
    return str(input('Введите номер телефона: '))
def get_new_office():
    print('\n============================================================================== \n')
    return str(input('Введите название отдела: '))
# Выбор должности    
def get_post():
    with open("post_book.json", "r", encoding = 'utf-8') as read_file:
        data = list(json.load(read_file))
        print('\n============================================================================== \n')
        for e in data:
            print(e)
        print('\n============================================================================== \n')
    return int(input('Введите ID должности: '))
# Выбор отдела
def get_office():
    with open("office_book.json", "r", encoding = 'utf-8') as read_file:
        data = list(json.load(read_file))
        print('\n============================================================================== \n')
        for e in data:
            print(e)
        print('\n============================================================================== \n')
    return int(input('Введите ID отдела: '))

#=======================================================================

# Создание новой должности
def get_new_post():
    print('\n============================================================================== \n')
    return str(input('Введите название должности: '))

# Создание ноого отдела
def get_new_office():
    print('\n============================================================================== \n')
    return str(input('Введите название отдела: '))

# Создание новой книги

def create_new_book():
    print('\n============================================================================== \n')
    return str(input('Введите название книги: '))

# Поиск по книге
def search_string():
    print('\n============================================================================== \n')
    print(' 1.ID сотрудника \n 2.Имя сотрудника \n 3.Телефон сотрудника \n 4.Должность сотрудника \n 5.Отдел')
    print('\n============================================================================== \n')
    return int(input('По каким кретериям ишем (введите цифру): '))

