# Задача 1: Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

n = str(input('Введите вещественное число: '))

def SummElement(n):
    spisok = list(n)
    print(spisok)
    for element in spisok:     # Удаляем запятую, если она имеется.
        if element == ',': 
            spisok.remove(',')

    summ = 0
    for element in spisok:     # Считаем сумму элементов.
        summ += int(element)
    return summ
print(SummElement(n))

#================================================================================================================================================
#================================================================================================================================================

# Задача 2: Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

N = int(input('Введите число: '))

def MultiSequence(N):
    spisok = list(range(1, N+1))        # Создаём список для хранения последовательности.
    multiplication = 1
    i = 0
    for element in spisok:              # Заполняем список последовательностью (1, 1*2, 1*2*3, 1*2*3*4).
        multiplication *= spisok[i]
        spisok[i] = multiplication
        i += 1
    print(spisok)
MultiSequence(N)